#include <iostream>
#include "Core.h"

void ObjUpdate(GmeObject* obj) {
    obj->rX += 2;
    obj->rY += 3;
    obj->rZ += 1;
}

void Frame() {
    Camera::Z += 0.2f;
    //Camera::rX += 2;
    Camera::rY += 1;
    //Camera::rZ += 1;
}

int main(int argc, char** argv)
{
    std::cout << "Hello World!\n";

    GmeObject* O;

    /*O = new GmeObject(4);

    O->X = -1.5f;
    O->Z = -6.0f;

    O->Vertexes = new float[36] {
            0, 1, 0,
            -1,-1,1,
            1,-1,1,
            0,1,0,
            1,-1,1,
            1,-1,-1,
            0,1,0,
            1,-1,-1,
            -1,-1,-1,
            0,1,0,
            -1,-1,-1,
            -1,-1,1
    };
    O->Colors = new char[48] {
            'ÿ', 0, 0, 'ÿ',
            0, 'ÿ', 0, 'ÿ',
            0, 0, 'ÿ', 'ÿ',
            'ÿ', 0, 0, 'ÿ',
            0, 'ÿ',0, 'ÿ',
            0, 0, 'ÿ', 'ÿ',
            'ÿ', 0, 0, 'ÿ',
            0, 'ÿ', 0, 'ÿ',
            0, 0, 'ÿ', 'ÿ',
            'ÿ', 0, 0, 'ÿ',
            0, 'ÿ', 0, 'ÿ',
            0, 0, 'ÿ', 'ÿ'
    };

    Core::Objects->Add(O);*/

    for (int x = 0, z = 0; z < 200;) {

        O = new GmeObject(12);

        O->Z = -(10 + z);
        O->X = (-100 + x);

        O->Y = -5;
        O->rX = 90;

        O->Vertexes = new float[108]{
                1,1,-1,
                -1,1,-1,
                -1,1,1,

                1,1,-1,
                1,1,1,
                -1,1,1,

                -1,-1,1,
                1,-1,1,
                1,-1,-1,

                -1,-1,1,
                -1,-1,-1,
                1,-1,-1,

                1,1,1,
                1,1,-1,
                1,-1,-1,

                1,1,1,
                1,-1,-1,
                1,-1,1,

                -1,-1,-1,
                -1,-1,1,
                -1,1,1,

                -1,-1,-1,
                -1,1,1,
                -1,1,-1,

                -1,1,1,
                1,1,1,
                1,-1,1,

                -1,-1,1,
                -1,1,1,
                1,-1,1,

                1,-1,-1,
                -1,-1,-1,
                -1,1,-1,

                1,1,-1,
                1,-1,-1,
                -1,1,-1
        };
        O->Colors = new char[144]{
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ',0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ',0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ',0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ',0, 'ÿ',
                0, 0, 'ÿ', 'ÿ',
                'ÿ', 0, 0, 'ÿ',
                0, 'ÿ', 0, 'ÿ',
                0, 0, 'ÿ', 'ÿ'
        };

        Core::Objects->Add(O);

        x+=2;
        if (x == 200) { x = 0; z+=2; }
    }

    Events::OnFrame = &Frame;
    Events::OnObjectUpdate = &ObjUpdate;
    Core::Start(argc, argv);
}